<template>
  <div class="modo2">
      <p class="modo2-p1">了解更多细则，请点击下方链接：</p>
      <button
        id="modo2-button"
        class="btn btn-primary btn-lg"
        data-toggle="modal"
        data-target="#myModal"
      >上海迪士尼乐园年卡须知</button>
      <div
        class="modal fade"
        id="myModal"
        tabindex="-1"
        role="dialog"
        aria-labelledby="myModalLabel"
        aria-hidden="true"
      >
        <div class="modal-dialog">
          <div class="modal-content">
            <div class="modal-header">
              <h4 class="modal-title" id="myModalLabel">上海迪士尼乐园年卡须知</h4>
            </div>
            <div class="modal-body">
              <ul id="modo2-ul">
                <li>本上海迪士尼乐园年卡之发出及使用受本须知，以及公布于上海迪士尼乐园（“乐园”）官网www.shanghaidisneyresort.com（“乐园官网”）和乐园入口处的《上海迪士尼乐园游客须知》的约束。上海迪士尼乐园年卡持有者须遵守本须知及《上海迪士尼乐园游客须知》。</li>
                <li>上海迪士尼乐园年卡不可转让、更换及退款，除非法律另有规定。</li>
                <li>上海迪士尼乐园年卡及其相应的福利仅限持卡人本人（即姓名印于该卡上的人）使用，如出现下述情况，我们有权随时撤销该卡而毋须退款或赔偿：（A）该卡被非持卡人本人用于入园或换取其它利益；（B）该卡和/或其项下的福利被用做商业用途（包括以转售为目的而获取或购买商品或服务）或被出于其他目的非正当使用； （C）游客有任何危险，非法或攻击性行为; 或（D）游客有违反《上海迪士尼乐园游客须知》以至可能妨碍乐园运营的其他行为。</li>
                <li>每一位游客名下只限持有一张与其名字绑定的上海迪士尼乐园年卡。如果一位游客拥有多张与其名字绑定的上海迪士尼乐园年卡，除第一张兑换的上海迪士尼乐园年卡外，其余年卡将无法使用。</li>
                <li>上海迪士尼乐园年卡有效期为三百六十五（365）天（“有效期”），自购买日起十五（15）天自动起算，不受兑换年卡及游客初次入园日期影响。年卡一旦兑换，即可正常使用（可用日期受限于各类型年卡的年卡日历），无论“有效期”是否已经开始起算。</li>
                <li>上海迪士尼乐园年卡分为以下三种：</li>
                <li>无限年卡：365天无限次入园，可能不包括部分特别活动时间段；</li>
                <li>平日+周日年卡： 受限于限定日期，年卡有效期内不少于250天的可入园日，包括大部分的星期日至星期五和部分寒假、暑假:</li>
                <li>周日年卡 ：受限于限定日期，年卡有效期内不少于45天的可入园日，包括大部分的星期日。</li>
                <li>上海迪士尼乐园年卡的适用入园日期及无效日期请以“上海迪士尼度假区官网”和“上海迪士尼度假区官方微信公众号”届时公布的【上海迪士尼乐园年卡日历】为准。通过【上海迪士尼乐园年卡日历】可查询六个月（包括查询当月）的可入园日历。每月中旬公布新月份的日历。【上海迪士尼乐园年卡日历】可能因政府公布的节假休息日调整而发生变更。此外，当乐园达到承载限额时，我们将无法保证任何年卡持卡游客入园。</li>
                <li>上海迪士尼乐园年卡的适用入园日期及无效日期请以“上海迪士尼度假区官网”和“上海迪士尼度假区官方微信公众号”届时公布的【上海迪士尼乐园年卡日历】为准。通过【上海迪士尼乐园年卡日历】可查询六个月（包括查询当月）的可入园日历。每月中旬公布新月份的日历。【上海迪士尼乐园年卡日历】可能因政府公布的节假休息日调整而发生变更。此外，当乐园达到承载限额时，我们将无法保证任何年卡持卡游客入园。</li>
                <li>上海迪士尼乐园年卡使用者本人须前往乐园主入口售票亭出示指定的个人身份证件原件和购卡订单号以兑换上海迪士尼乐园年卡。内地游客，须提供中华人民共和国居民身份证；香港、澳门地区游客，须提供《港澳居民来往内地通行证》或《中华人民共和国旅行证》；台湾地区游客，须提供《台湾居民来往大陆通行证》或《中华人民共和国旅行证》；其他国家及地区游客，须提供有效护照。</li>
                <li>我们将采集游客照片和身份信息作为上海迪士尼乐园年卡持有者的凭证，并与该上海迪士尼乐园年卡绑定，上海迪士尼乐园年卡持有者的姓名和照片不可更改。</li>
                <li>所有上海迪士尼乐园年卡持卡游客每次入园都须按正常程序从乐园主入口入园，并请遵从演职人员的指引。</li>
                <li>游客使用上海迪士尼乐园年卡入园时，必须出示用于激活上海迪士尼乐园年卡时所使用的个人身份证件原件来核实身份，确保上海迪士尼乐园年卡是由持卡人本人使用。</li>
                <li>上海迪士尼乐园年卡在其有效期内相应日期的乐园开放时间段提供入园权限（具体运营时间将于度假区官网或上海迪士尼度假区视其方便的其他资讯上公布）</li>
                <li>此上海迪士尼乐园年卡不适用于另行收费的特别活动时间段及华特迪士尼大剧院入场，无免费停车特权。</li>
                <li>若需申请补办丢失的上海迪士尼乐园年卡，上海迪士尼乐园年卡持有人须务必（i）亲自前往位于乐园外的游客服务中心现场填写并提交上海迪士尼乐园年卡补办申请；（ii）提供原持卡人用于激活上海迪士尼乐园年卡所使用的个人身份证件原件、原始收据及我们可能要求提供的其他个人信息。在补卡申请提交后，丢失的上海迪士尼乐园年卡将做失效处理不可再次使用。在发放新上海迪士尼乐园年卡之前，我们将核实您的身份信息和照片信息以确保与原持卡人本人匹配。申请手续将于三天内完成。和其他所有票务产品相同，游客须遵守乐园准则和相关规定进入上海迪士尼乐园。</li>
                <li>上海迪士尼乐园年卡持卡人应妥善保存上海迪士尼乐园年卡，如因保管不善致卡面信息无法辨识，可能将导致无法正常使用。发生此类情况时，上海迪士尼乐园年卡持卡人须本人前往游客服务中心寻求帮助。</li>
                <li>出于乐园承载量，恶劣天气，特别活动，安全、安保或秩序原因，或情况所需，我们可能会不时更改乐园营运时间或乐园内任何游乐项目的开放时间，暂时关闭乐园或乐园内的任何部份区域，限制入园人数，及/或暂停或取消任何游乐设施或娱乐演出。</li>
                <li>本须知可能发生变更。对于任何重大变更，我们将向您发出通知。任何该等通知将会以电子邮件、</li>
              </ul>
            </div>
            <div class="modal-footer">
              <button type="button" id="modo2-shut" class="btn btn-default" data-dismiss="modal">关闭</button>
            </div>
          </div>
        </div>
      </div>
      <div class="modo2-a1">
        <a
          href="https://www.shanghaidisneyresort.com/new-child-ticket-annualpass-criteria/"
        >上海迪士尼乐园年卡专享福利</a>
      </div>
      <div class="modo2-a2">
        <a
          href="https://www.shanghaidisneyresort.com/new-child-ticket-annualpass-criteria/"
        >新儿童票定义标准</a>
      </div>
    </div>
</template>

<script>

export default {
  name: 'modo2',
  props: {}
}

</script>
